app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
---
        @sorting = session[:sorting]
      end

      @movies = Movie.all